{
  "todos": {
    "Coordinator": {
      "1": {
        "id": "1",
        "content": "Mevcut PyWhatApp kodunu analiz et ve gereksinimlerini belirle",
        "details": "1. Mevcut Streamlit kodunu incele. 2. Özellikler ve fonksiyonları listele. 3. UI/UX iyileştirme noktalarını tespit et.",
        "status": "completed",
        "priority": "high"
      },
      "2": {
        "id": "2",
        "content": "Modern micro SaaS UI/UX tasarımını araştır",
        "details": "1. WhatsApp benzeri modern UI tasarım trendlerini araştır. 2. Micro SaaS dashboard best practice'lerini incele. 3. Admin panel tasarım örneklerini topla. 4. Landing page tasarım trendlerini araştır. 5. Medya dosya upload UI/UX örneklerini incele.",
        "status": "pending",
        "priority": "high"
      },
      "3": {
        "id": "3",
        "content": "Gelişmiş React frontend micro SaaS uygulaması geliştir",
        "details": "1. Landing page (özellikler, görseller, fiyatlandırma). 2. Kullanıcı kayıt/giriş sistemi. 3. Ana dashboard. 4. Admin dashboard. 5. Değişken yönetim sistemi (sayın, değerli, kıymetli, sevgili, tarih, custom). 6. Medya upload sistemi (ses, resim, video, belge). 7. WhatsApp kişi yönetimi. 8. Mesaj şablon editörü. 9. İstatistik ve raporlama. 10. Responsive tasarım.",
        "status": "pending",
        "priority": "high"
      },
      "4": {
        "id": "4",
        "content": "Kapsamlı backend API ve Supabase entegrasyonu",
        "details": "1. Kullanıcı authentication sistemi. 2. Rol tabanlı yetkilendirme (admin, user). 3. WhatsApp Web entegrasyonu. 4. WhatsApp Business API entegrasyonu. 5. Kişi listesi senkronizasyonu. 6. Medya dosya upload ve storage. 7. Değişken sistemi API'leri. 8. Mesaj şablon yönetimi. 9. Toplu gönderim sistemi. 10. İstatistik ve analitik API'leri. 11. Cron job'lar için background işlemler.",
        "status": "pending",
        "priority": "high"
      },
      "5": {
        "id": "5",
        "content": "Uygulamayı test et ve deploy et",
        "details": "1. Tüm fonksiyonları test et. 2. UI/UX testleri yap. 3. Uygulamayı kullanıcı dostu hale getir. 4. Production'a deploy et.",
        "status": "pending",
        "priority": "medium"
      }
    }
  }
}