{"extracted_information": "Bu makale, Uploadcare'in dosya yükleyicisini inşa ederken erişilebilirliği nasıl ele aldığını ayrıntılandırıyor. Klavye navigasyonu, ekran okuyucu desteği, WCAG uyumluluğu ve genel erişilebilirlik en iyi uygulamalarına odaklanılmıştır.", "specifications": {"WCAG_Principles": [{"name": "Algılanabilir (Perceivable)", "description": "Web sitesindeki içerik ve widget öğeleri kullanıcıların kolayca fark edebileceği şekilde görüntülenmelidir. Kullanıcının web sitesine veya widget'a nasıl eriştiği önemli olmaksızın, içeriği okuyarak veya dinleyerek anlayabilmeleri sağlanır."}, {"name": "İşletilebilir (Operable)", "description": "Bileşenler ve navigasyon işlevsel olmalı, kullanıcıların farklı yöntemlerle (klavye navigasyonu gibi) tüm öğelerle etkileşim kurmasına izin vermelidir."}, {"name": "Anlaşılır (Understandable)", "description": "Bilgi ve kullanıcı arayüzü anlaşılması kolay, doğru ve tutarlı içerik sağlamalıdır."}, {"name": "Sağlam (Robust)", "description": "İçerik, kullanıcıların çeşitli cihazlar kullanarak web sitesine ulaşacakları gerçeği nedeniyle, farklı kullanıcı cihazlarıyla (yardımcı teknolojiler dahil) tutarlı bir şekilde çalışabilmeli ve gelecekteki değişikliklere karşı dirençli olmalıdır."}], "Color_Contrast_Ratio": "Standart metin için 4.5:1 veya daha yüksek kontrast oranı önerilir.", "ARIA_Attributes_Used": ["`aria-modal=\"true\"` (modal açıkken içeriğin etkileşimli olduğunu belirtmek için)", "`aria-live` ve `aria-label` (ekran okuyuculardan hata ve geri bildirimleri duyurmak için)", "`aria-live=\"polite\"` (içeriğin yardımcı teknolojilere erişilebilir olmasını ve kullanıcıların neler olup bittiğini anlamasını sağlamak için)"]}, "pricing": {}, "features": [{"name": "Klavye Navigasyonu", "description": "Dosya seçimi ve gönderme gibi etkileşimli bileşenler için varsayılan tarayıcı odağı kullanılır. Odak durumları kolayca görülebilir ve kullanıcılara yardımcı olacak görsel ipuçları sağlanmıştır.", "best_practices": ["Motor veya görme engelli kullanıcılar için klavye navigasyonunu dahil etmek veya bu seçeneği bileşende sunmak esastır.", "Tüm etkileşimli bileşenlerde varsayılan tarayıcı odağını kullanın.", "Odak durumlarının kolayca görülmesini ve görsel ipuçları sağlanmasını sağlayın."]}, {"name": "Semantik HTML", "description": "Yardımcı teknolojilerin uygulamaları kolayca anlamasına yardımcı olan semantik yapı. Anlamı ve yapıyı etkili bir şekilde iletmek için semantik HTML etrafına özel HTML etiket sarmalayıcıları kullanılmıştır. Örneğin, `<input type='file'>` elemanı dosya seçimi için, `<button>` elemanları ise dosya gönderme, dosya gezginini açma veya yüklemeyi iptal etme gibi eyleme dönük öğeler için kullanılmıştır. Yardımcı teknolojilerin yükleyiciyi gezinebilmesi için uygun etiketler ve başlıklar sağlanmıştır.", "best_practices": ["Yardımcı teknolojilerin uygulamaları kolayca anlaması için semantik bir yapı kullanın.", "Anlamı ve yapıyı etkili bir şekilde iletmek için özel HTML etiket sarmalayıcıları kullanın.", "Eyleme dönük öğeler için `<button>` gibi uygun HTML elemanlarını kullanın.", "Kullanıcı deneyimini iyileştirmek ve yardımcı teknolojilerin gezinebilmesini sağlamak için uygun etiketler ve başlıklar sağlayın."]}, {"name": "Hata Yönetimi ve Kullanıcı Geri Bildirimi", "description": "Tüm hata mesajları hem görsel hem de işitsel olarak iletilir. Desteklenmeyen veya çok büyük dosya türlerinde hata mesajları görsel olarak ve açıklamalarıyla birlikte görüntülenir. Ekran okuyucu kullanıcıları için `aria-live` ve `aria-label` kullanılarak hatalar ve geri bildirimler duyurulur. Dosya başarıyla yüklendiğinde de benzer geri bildirim mekanizmaları uygulanır.", "best_practices": ["Hata mesajlarını hem görsel hem de işitsel olarak iletin.", "Ekran okuyucular ve diğer yardımcı teknolojiler için `aria-live` ve `aria-label` kullanarak hataları ve geri bildirimleri duyurun.", "Kullanıcıların yükleme durumunu anlamasını ve uygun eylemi yapmasını sağlayın."]}, {"name": "Renk Kontrast Oranı", "description": "Görme engelli kullanıcıların ihtiyaçlarını karşılamak için renk kontrastına odaklanılmıştır. Tüm metin ve etkileşimli öğeler, metnin arka plandan ayırt edilmesini sağlayan iyi bir renk kontrast oranına sahiptir. Standart metin için 4.5:1 veya daha yüksek bir kontrast oranı hedeflenmiştir.", "best_practices": ["Görme engelli kullanıcılar için yeterli renk kontrast oranını sağlayın.", "Tüm metin ve etkileşimli öğelerde iyi bir kontrast oranı bulundurun (örneğin, standart metin için 4.5:1 veya daha yüksek)."]}, {"name": "ARIA Nitelikleri (Attributes)", "description": "Ekran okuyucular gibi yardımcı teknolojiler için erişilebilirliği artıran roller ve nitelikler koleksiyonudur. `aria-live=\"polite\"` nitelikleri kullanılarak içeriğin yardımcı teknolojilere erişilebilir olduğu ve kullanıcıların neler olup bittiğini anlayabileceği garanti edilir. Örnek: `aria-modal=\"true\"` modal açıkken sadece modal içindeki içeriğin etkileşimli olduğunu belirtmek için.", "best_practices": ["Yardımcı teknolojiler için erişilebilirliği artırmak amacıyla ARIA niteliklerini kullanın.", "`aria-live` gibi niteliklerle içeriğin dinamik güncellemelerini bildirin."]}, {"name": "Mobil Odaklı Tasarım", "description": "Dosya yükleyici mobil cihazlara öncelik verilerek oluşturulmuş olup, tüm cihaz türlerinde kullanılabilirliği sağlanmıştır. Yükleyicinin tamamen duyarlı olduğu ve tüm etkileşimli özelliklere mobil cihazlarda kolayca erişilebildiği garanti edilmiştir.", "best_practices": ["Dosya yükleyiciyi mobil cihazlara öncelik vererek tasarlayın.", "Tamamen duyarlı olduğundan ve tüm etkileşimli özelliklere mobil cihazlarda kolayca erişildiğinden emin olun."]}], "statistics": {}, "temporal_info": {"publication_date": "October 4, 2024"}, "geographical_data": {}, "references": [{"name": "WCAG at a Glance", "url": "https://www.w3.org/WAI/standards-guidelines/wcag/glance/", "type": "WCAG standard reference"}, {"name": "Video tutorial: Making your own file uploader more accessible", "url": "https://youtu.be/chEpo27cTHw", "type": "Educational resource"}, {"name": "Lighthouse", "url": "https://github.com/GoogleChrome/lighthouse", "type": "Accessibility testing tool"}, {"name": "axe", "url": "https://www.deque.com/axe/", "type": "Accessibility testing tool (browser extension)"}, {"name": "NVDA", "url": "https://www.nvaccess.org/download/", "type": "Screen reader (Windows)"}, {"name": "VoiceOver", "url": "https://support.apple.com/en-ng/guide/voiceover/welcome/mac", "type": "Screen reader (macOS and iOS)"}, {"name": "JAWS", "url": "https://www.freedomscientific.com/products/software/jaws/", "type": "Screen reader (Windows)"}, {"name": "Color Contrast Checker (WebAIM)", "url": "https://webaim.org/resources/contrastchecker/", "type": "Color contrast testing tool"}]}