{"extracted_information": "Airtable'ın Arayüz Tasarımcısı (Interface Designer), metrikleri raporlamak ve önemli bilgileri tek bir yerde görüntülemek için 'pano düzeni'ni kullanarak özelleştirilebilir panolar oluşturmaya olanak tanır. Panolar, bilgiyi bir araya getirmek, trendleri vurgulamak veya dağılımı çizelgeler ve grafiklerle görselleştirmek için idealdir. Özellikle üst düzey yönetim ekipleri için detaylı şirket bilgilerini sunarak bilinçli kararlar almalarına yardımcı olur. Bir panoyu oluştururken, bir temel (base) seçmek, çözülmesi gereken problemi belirlemek, hedef kitleyi ve ihtiyaç duydukları bilgiyi analiz etmek önemlidir. Arayüz grubuna açıklayıcı bir isim ve açıklama vermek, işbirlikçilerin panoyu nasıl kullanacaklarını anlamalarına yardımcı olur. Pano düzeni seçildikten sonra, görüntülenmek istenen bilgileri içeren tablonun bağlanması gerekmektedir. Pano düzeni, özetler, çizelgeler ve grafikler ekleme/kaldırma imkanı sunar. Düzenleme modunda diğer tablolardan da bilgi çekmek mümkündür.", "specifications": {"dashboard_layout_elements": ["Sayı öğeleri (Number elements): En üst düzey metrikleri (örn. büyük özellik sayısı, risk altındaki özellikler, en erken yayın tarihi) göstermek için kullanılır.", "Tarih özetleme seçenekleri (Number element for dates): En erken tarih (earliest date), en geç tarih (latest date), ay sayısı (number of months), gün sayısı (number of days) olarak özetlenebilir.", "Grafikler (Charts): NPS puanları gibi verileri zaman içinde görselleştirmek için kullanılır. X ve Y eksenleri özelleştirilebilir (örn. X ekseni tarihler, Y ekseni ortalama NPS puanı).", "Zaman Çizelgesi görünümü (Timeline view): Özelliklerin lansman tarihlerini düzenli bir zaman çizelgesinde gösterir.", "Tablo görünümü (Grid view): Bir tablodan belirli bilgileri (örn. önceliklendirilmiş müşteri geri bildirimleri) görüntülemek için kullanılır."], "design_recommendations": ["Metin öğeleri (Text elements) kullanarak başlıklar oluşturma (bilgiye bağlam kazandırmak için).", "Sayıları bir arada tutma.", "Bilgiyi ayırmak için renk kullanma.", "Pano arayüzünün sonsuz bir kaydırma haline gelmemesi için çok fazla öğe eklememek.", "Blokları hareket ettirerek alanı azaltma.", "Tek bir pano çok uzun hale gelirse, farklı yol haritaları için birden fazla pano oluşturma."]}, "pricing": {}, "features": ["Arayüz Tasarımcısı (Interface Designer) aracılığıyla pano düzeni seçeneği.", "Mevcut tablolardaki verilere bağlanma.", "Otomatik olarak bağlanan öğeleri açma/kapatma yeteneği.", "Düzenleme modunda diğer tablolardan bilgi çekebilme (örn. sayı öğeleri için).", "Kullanıcıların bilgileri kendileri filtrelemesine izin verme (zaman çizelgeleri, tablolar ve grafikler gibi veri açısından zengin öğelerde).", "Arayüzdeki öğe ve blokları yeniden düzenleme/taşıma.", "Arayüzü belirli bir işbirlikçi için 'görüntüle' (view as) modunda önizleme.", "Arayüzü yayınlama.", "E-posta veya bağlantı yoluyla işbirlikçilerle paylaşma.", "İşbirlikçiler için ayrıntılı izin seviyeleri belirleme (temel erişimi dahil).", "Sayfa ve öğe düzeyinde kullanıcı filtreleri ile kişiselleştirilmiş deneyimler oluşturma.", "Enterprise planı için kullanıcı grupları (user groups) ile kullanıcı erişimini yönetme ve bilgileri rol/takım bazında kişiselleştirme."], "statistics": {}, "temporal_info": {"quarterly_goals": "Çeyreklik hedefler", "release_date_filter": "Yayın tarihi alanı 'dünden sonra' olarak filtrelenebilir (gelecekteki herhangi bir gün).", "nps_scores_over_time": "NPS puanları zaman içinde vurgulanabilir."}, "geographical_data": {}, "references": [{"description": "Öğeleri Yapılandırma", "url": "https://support.airtable.com/docs/configuring-elements-in-interfaces"}, {"description": "Görünüm Seçenekleri", "url": "https://support.airtable.com/hc/en-us/articles/4411997716375#h_01FKETK7RJK83XNE87TGHMPY63"}, {"description": "Yayınlama İşlemi", "url": "https://support.airtable.com/hc/en-us/articles/4411997716375#h_01FKETKCA2C395B9VH8N263RYP"}, {"description": "Kullanıcı Grupları", "url": "https://support.airtable.com/docs/user-groups"}, {"description": "Arayüz Tasarımcısı İzinleri", "url": "https://support.airtable.com/docs/interface-designer-permissions"}]}