{"extracted_information": "Airtable Arayüz Tasarımcısı için en iyi uygulamalar, kullanıcı arayüzü tasarım yönergeleri ve arayüz oluşturma önerileri aşağıda detaylandırılmıştır.", "specifications": {}, "pricing": {}, "features": [{"title": "Arayüz Oluşturmadan Önce Temel Sorular", "description": "Arayüz Tasarımcısı'na başlamadan önce kendinize iki önemli soru sorun:", "details": ["1. Kimin için bir arayüz oluşturuyorum?", "2. Bu arayüzle ne yapmaları gerekiyor?", "Bu soruları süreç boyunca akılda tutmak, doğru kararlar almanıza yardımcı olacaktır. Hedef kitleye (örn. tasarımcılar, üst düzey yöneticiler) göre arayüzün düzeni ve elemanları şekillendirilmelidir."]}, {"title": "İş Akışınızı Destekleyecek Bir Arayüz Düzeni Seçin", "description": "Arayüz düzenleri, tabanınızdaki verilere doğrudan bağlanan şablonlardır ve her biri belirli iş akışları için optimize edilmiştir. Mevcut dört düzen:", "details": [{"name": "Kayıt İncelemesi (Record review)", "purpose": "Birden çok kaydı hızlıca gözden geçirmek (örn. verileri sınıflandırma veya iş onaylama) gerektiğinde kullanılır.", "example": "Tasarımcıların birden fazla kaydı incelemesi ve her biri üzerinde belirli eylemler yapması için ideal."}, {"name": "Kayıt Özeti (Record summary)", "purpose": "Bir seferde belirli bir kayda odaklanmanız gerektiğinde optimize edilmiş, daha anlatı odaklı bir düzen.", "example": "Tek bir kaydın detaylı görünümü için."}, {"name": "Kontrol Paneli (Dashboard)", "purpose": "Çok sayıda üst düzey bilgiyi (örn. özellik yol haritaları veya OKR raporlaması) aktarması gereken kişiler için bir genel bakış.", "example": "Kuruluş liderlerine metrik raporlama için doğru seçim."}, {"name": "Boş (Blank)", "purpose": "Belirli bir iş akışını özelleştirmek için net bir fikri olanlar için boş bir tuval.", "example": "Tamamen özel bir arayüz ihtiyacı olanlar için."}]}, {"title": "Arayüzünüze Hiyerarşi Vermek İçin 'Elemanları' Kullanın", "description": "Elemanlar, arayüzünüzü doldurmak için sürükleyip bırakabileceğiniz yapı taşlarıdır. Verileri elemanlarla düzenleme şekliniz, kullanıcıların nereye odaklanacağını ve bilgiyle nasıl etkileşim kurmaları gerektiğini gösterir.", "details": [{"guideline": "Benzer Elemanları Bir Arada Gruplandırın", "description": "Benzer bilgilerin birlikte olduğunu göstermek için elemanları mekansal olarak gruplandırın. İlgili elemanları yan yana sütunlara yerleştirmeyi, bölümleri ayırıcı elemanla ayırmayı veya benzer elemanlara aynı arka plan rengini vermeyi düşünün."}, {"guideline": "Belirli Alanlara Vurgu Yapın", "description": "Kayıtlarınızı görsel, sindirilebilir şekillerde göstererek insanların nereye odaklanacağını bildirin. Bir grafik oluşturun, bir zaman çizelgesi üzerinde düzenleyin veya bir ızgara ekleyin."}, {"guideline": "Kullanıcıları Arayüzde Yönlendirmek İçin Metin Kullanın", "description": "Daha görsel elemanlarınız için metinle bağlam sağlayın. Başlıklar oluşturmak, harekete geçirici mesajlar (CTA'lar) paylaşmak için metin elemanını kullanın ve arayüzünüze stil katmak için emoji kullanmaktan çekinmeyin; her şey kullanıcıları yönlendirmeye yardımcı olacaktır."}]}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": ["https://www.airtable.com/?ref=blog.airtable.com", "https://www.youtube.com/watch?v=ZnI6mXmul_Q&list=PLkcBLUN49n2Gj4JPCDv7pJum1--M0al3X&ref=blog.airtable.com (Table Talk videosu)", "https://blog.airtable.com/introducing-interface-designer/ (Arayüz Tasarımcısı tanıtım blog yazısı)", "https://blog.airtable.com/what-is-a-workflow/", "https://www.airtable.com/guides/collaborate/interface-designer-record-review?ref=blog.airtable.com (Kayıt İncelemesi rehberi)", "https://www.airtable.com/guides/collaborate/interface-designer-record-summary-layout?ref=blog.airtable.com (Kayıt Özeti rehberi)", "https://www.airtable.com/guides/collaborate/interface-designer-dashboards?ref=blog.airtable.com (Kontrol Panelleri rehberi)", "https://blog.airtable.com/tag/interface-elementals/", "https://www.airtable.com/guides/collaborate/getting-started-with-interface-designer?ref=blog.airtable.com (Arayüz Tasarımcısı başlama rehberi)", "https://airtable.com/help_link/v-howToCreateAnInterface?ref=blog.airtable.com"]}