{"raw_content": "{\n  \"data\": {\n    \"extracted_information\": \"Bu içerik, B2B SaaS ürünleri için düşünceli kontrol panelleri tasarlamaya yönelik kapsamlı bir metodoloji, kullanıcı ve iş hedeflerini hizalama yaklaşımları ve pratik tasarım adımları sunmaktadır.\",\n    \"methodology_approach\": \"Gerçek dünya sorunlarını çözen ve hem kullanıcılar hem de iş için çalışan kontrol panelleri tasarlamak için kullanılan problem çözme yaklaşımı, diğer tasarım sorunlarına yaklaşmaktan farksızdır. Bu, tasarım süreci boyunca başvurulacak bir kontrol listesi görevi görür.\",\n    \"design_steps\": [\n      {\n        \"step_number\": 1,\n        \"title\": \"Kontrol panelinin amacını tanımlamak için kullanıcı hedeflerini, iş hedeflerini ve mevcut kullanım modellerini belirleyin\",\n        \"details\": [\n          \"Kontrol panelini kim kullanıyor ve hangi kararları alıyor? (Örn: CFO, bölgesel operasyon yöneticisi, depo amiri, veri analisti gibi farklı kullanıcı tipleri ve değişken hedefler).\",\n          \"İşletme neyi başarmaya çalışıyor? (Örn: müşteri kaybını azaltma, dönüşümleri artırma, destek taleplerini düşürme). Kontrol paneli, hem kullanıcı ihtiyaçları hem de iş sonuçları ile uyumlu kararları desteklemelidir.\"\n        ],\n        \"goal_alignment\": true\n      },\n      {\n        \"step_number\": 2,\n        \"title\": \"Kontrol panelinin hangi temel kararları desteklemesi gerektiğini ve hedeflerin izlenmesine nasıl yardımcı olacağını belirleyin\",\n        \"details\": [\n          \"Hedeflere ulaşılıp ulaşılmadığını gösteren belirli metrikler olan Anahtar Performans Göstergeleri (KPI'lar) ölçülmelidir.\",\n          \"Kontrol paneli ne sıklıkla kullanılacak? Bu, hangi KPI'ların önceliklendirileceğini ve düzenin, navigasyonun nasıl tasarlanacağını etkiler.\"\n        ],\n        \"goal_alignment\": true\n      },\n      {\n        \"step_number\": 3,\n        \"title\": \"Kontrol paneli tipine karar verin, doğru KPI'ları seçin ve bunları görselleştirmenin en açık yolunu seçin\",\n        \"details\": [\n          \"Kontrol paneli tipleri: Stratejik (uzun vadeli trendler, üst düzey KPI'lar, üst yönetim), Operasyonel (gerçek zamanlı, anında eylem, saha ekipleri), Analitik (orta vadeli veri, kapsamlı genel bakış, orta düzey yöneticiler), Taktiksel (operasyonları izleme ve optimize etme, departman başkanları).\",\n          \"Veriyi en iyi nasıl temsil edersiniz? (Veri görselleştirmenin 4 ayağı: Dağılım, İlişki, Karşılaştırma, Kompozisyon). Görselleştirmede ölçeklenebilirlik ve kullanılabilirlik kritiktir.\",\n          \"KPI'larınızı kontrol panelinde nereye yerleştireceğinize karar verin? (Metrikler Etki, Eyleme Geçirilebilirlik ve Netlik temelinde önceliklendirilmelidir).\"\n        ]\n      },\n      {\n        \"step_number\": 4,\n        \"title\": \"Doğru içgörüleri doğru zamanda yüzeye çıkaran bir düzen ve akış haritalandırın. Ardından işe yarayanı yineleyin.\",\n        \"details\": [\n          \"Görsel öğeleri yapılandırmak için tanıdık tarama desenlerini kullanın (sol üstten sağ alta).\",\n          \"Kaydırma ve sayfa katmanına dikkat edin (önemli KPI'lar yukarıda olmalı).\",\n          \"İçeriğe göre widget boyutlarını ayarlayın (KPI kutucukları kompakt, zaman serisi grafikleri daha geniş).\",\n          \"İlk kez kullananların ihtiyaçlarını göz önünde bulundurun (gerekirse onboarding).\",\n          \"Önem ve mantıksal sıraya göre önceliklendirin (veri hiyerarşisi ve anlatım).\",\n          \"5 Saniye Kuralı: 'Kullanıcılar aradıkları bilgiyi 5 saniye içinde tanımlayabilmelidir.'\"\n        ]\n      },\n      {\n        \"step_number\": 5,\n        \"title\": \"Çalışmanızın temelini sarsabilecek sürprizleri önlemek için paydaşları erken ve sık sık döngüye dahil edin.\",\n        \"details\": [\n          \"Kullanıcı yolculuklarını ve iş hedeflerini açıklığa kavuşturun.\",\n          \"KPI'ların kullanıcı ve iş hedeflerini gerçekten yansıtıp yansıtmadığını doğrulayın.\",\n          \"Teknik fizibiliteyi ve veri kullanılabilirliğini onaylayın.\",\n          \"Uygulama ve yanıt verme ile ilgili zorlukları önleyin.\",\n          \"Kullanılabilirlik veya erişilebilirlik sorunlarını yakalayın.\",\n          \"Tasarım sistemi kontrolü yapın.\",\n          \"Görsel hiyerarşiyi ve düzeni iyileştirin.\"\n        ]\n      },\n      {\n        \"step_number\": 6,\n        \"title\": \"Yalnızca görsel tasarıma değil, ilk adımda tanımlanan hedeflere ve işlevselliğe dayalı olarak kullanıcılarla doğrulayın.\",\n        \"details\": [\n          \"Kullanıcılar aradıkları KPI'yı hızla bulabiliyor mu?\",\n          \"Verilerin ne anlama geldiğini ve hangi eylemi yapacaklarını anlıyorlar mı?\",\n          \"Ek açıklama gerektirmeden trendleri yorumlayabiliyorlar mı?\",\n          \"Bu kontrol paneli, sorunlarını çözmelerine veya temel sorularını yanıtlamalarına yardımcı oluyor mu?\",\n          \"Görev tabanlı sorular sorun (örn: 'X'i başarmaya çalışsaydınız, önce nereye bakardınız?').\",\n          \"Doğrulama yöntemleri: Sesli düşünme protokolleri, kullanılabilirlik testleri, ilk tıklama testi.\"\n        ],\n        \"goal_alignment\": true\n      }\n    ],\n    \"common_mistakes_to_avoid\": {\n      \"structuring_and_layout\": [\n        \"Dinamik ihtiyaçlar için katı düzenler tasarlamak (özelleştirme imkanı sunulmalı).\",\n        \"Düşük öncelikli bilgileri vurgulamak (öncelikli bilgiler ana konuma yerleştirilmeli).\"\n      ],\n      \"data\": [\n        \"Kontrol panelini veriyle aşırı yüklemek (karar yorgunluğuna yol açar, aşamalı açıklama kullanılmalı).\",\n        \"Verileri mantıksal bir sıra olmadan sunmak (bilgiler hiyerarşik olarak düzenlenmeli).\",\n        \"Kontrol panelini bir veri dökümü gibi ele almak (kararları bilgilendirmek için düzenlenmiş görünümler olmalı).\"\n      ],\n      \"user_context\": [\n        \"Zaman damgalarını veya güncellenmiş bağlamı atlamak (verinin güvenilirliği için gerekli).\",\n        \"Sayıları bağlam olmadan göstermek (bağlam, verinin ne anlama geldiğini anlamaya yardımcı olur).\"\n      ],\n      \"color_usage\": [\n        \"Erişilebilirliği (özellikle renk kullanımını) göz ardı etmek (renk körlüğü olan kullanıcılar için alternatifler kullanılmalı).\",\n        \"Yapıyı çözmeden görsellere atlamak (önce kullanıcı hedefleri ve KPI'lar belirlenmeli).\",\n        \"Renkleri aşırı kullanmak (anlamı belirtmek için sınırlı palet kullanılmalı).\",\n        \"Amacı olmayan trendleri göstermek (içgörü veya eyleme geçirilebilirlik sunmayan grafikler çıkarılmalı).\"\n      ]\n    },\n    \"specifications\": {\n      \"kpi_characteristics\": [\n        \"Bir hedefe doğrudan bağlı\",\n        \"Eyleme geçirilebilir\",\n        \"Bir bakışta kolayca yorumlanabilir\"\n      ],\n      \"dashboard_types\": {\n        \"stratejik\": \"Uzun vadeli trendler ve karmaşık veri desenleri; yüksek seviyeli KPI'lar; üst düzey liderlik (örn: CFO).\",\n        \"operasyonel\": \"Gerçek zamanlı veya yakın gerçek zamanlı güncellemeler; anında eylem; saha ekipleri veya genç karar vericiler (örn: depo amiri).\",\n        \"analitik\": \"Orta vadeli veriler; KPI'lara kapsamlı genel bakış; orta düzey yöneticiler (örn: ürün müdürü).\",\n        \"taktiksel\": \"Proje, ekip çıktısı veya iş akışı verimliliğini izleme; belirli bir departmana veya fonksiyona odaklı; departman başkanları, ekip liderleri (örn: pazarlama yöneticisi).\"\n      },\n      \"data_visualization_pillars\": [\n        \"Dağılım (değerlerin yayılımı veya frekansı)\",\n        \"İlişki (değişkenler arası korelasyon)\",\n        \"Karşılaştırma (kategoriler arası)\",\n        \"Kompozisyon (bütünün parçaları)\"\n      ],\n      \"layout_principles\": [\n        \"Tanıdık tarama desenleri kullanın (sol üstten sağ alta, en değerli metrikler bu yola yerleştirilmeli).\",\n        \"Kaydırma ve sayfa katmanına dikkat edin (öncelikli metrikler 'above the fold' olmalı).\",\n        \"İçeriğe göre widget boyutlarını ayarlayın (örn: KPI kutucukları kompakt, zaman serisi grafikleri daha geniş).\",\n        \"İlk kez kullananların ihtiyaçlarını göz önünde bulundurun (gerekirse onboarding widget'ları).\",\n        \"Önem ve mantıksal sıraya göre önceliklendirin (veri hiyerarşisi ve 'veri anlatımı').\"\n      ],\n      \"metrics_prioritization_criteria\": [\n        \"Etki: Eksik başvuruları azaltmaya yardımcı oluyor mu?\",\n        \"Eyleme Geçirilebilirlik: Son kullanıcı bu veriyi formu iyileştirmek için kullanabilir mi?\",\n        \"Netlik: Veri kolay anlaşılır ve eyleme geçirilebilir mi?\"\n      ],\n      \"design_rule\": \"5 Saniye Kuralı: Kullanıcılar aradıkları bilgiyi 5 saniye içinde tanımlayabilmelidir.\"\n    },\n    \"temporal_info\": {\n      \"article_publication_date\": \"Temmuz, 2025\"\n    },\n    \"references\": [\n      {\n        \"title\": \"From Good To Great In Dashboard Design: Research, Decluttering And Data Viz\",\n        \"url\": \"https://www.smashingmagazine.com/2021/11/dashboard-design-research-decluttering-data-viz/\"\n      },\n      {\n        \"title\": \"10 rules for better dashboard design\",\n        \"url\": \"https://uxplanet.org/10-rules-for-better-dashboard-design-ef68189d734c\"\n      },\n      {\n        \"title\": \"Three types of Dashboards\",\n        \"url\": \"https://think.design/blog/three-types-of-dashboards/\"\n      },\n      {\n        \"title\": \"Presenting Your Data\",\n        \"url\": \"https://medium.com/ds3ucsd/eyeballing-the-data-ea77437ff6db\"\n      },\n      {\n        \"title\": \"Mobbin for product inspiration\",\n        \"url\": \"https://mobbin.com/\"\n      },\n      {\n        \"title\": \"Dashboard Design UX Patterns\",\n        \"url\": \"https://www.pencilandpaper.io/articles/ux-pattern-analysis-data-dashboards\"\n      },\n      {\n        \"title\": \"What are KPI dashboards?\",\n        \"url\": \"https://www.microsoft.com/en/power-platform/products/power-bi/topics/dashboards/kpi-dashboards\"\n      },\n      {\n        \"title\": \"4 pillars of data visualization: distribution, relationship, composition, comparison\",\n        \"url\": \"https://medium.com/data-science/4-pillars-of-data-visualization-distribution-relationship-composition-comparison-935cf9248f97\"\n      },\n      {\n        \"title\": \"Top 30 Best Dashboard UI/UX Design Principles You Must Know in 2025\",\n        \"url\": \"https://www.aufaitux.com/blog/dashboard-design-principles/#:~:text=5.,that%20is%2C%20at_first_glance.\"\n      },\n      {\n        \"title\": \"Interaction Design Foundation (IxDF) — Design Thinking\",\n        \"url\": \"https://www.interaction-design.org/literature/topics/design-thinking?srsltid=AfmBOoqGkt9KTjN8W5Y0xqJTj7xrLkDXb6UU6IPQ3wG3RUsAIG_ZBE-y\"\n      },\n      {\n        \"title\": \"What is the UX Design Process? 5 Steps to Success\",\n        \"url\": \"https://www.interaction-design.org/literature/article/ux-design-process-guide?srsltid=AfmBOop5JvEQcvbSuH5M6vQYZmTSmLdaT4Z7e3I23eJOyNaR4lN4iiXR#step_5:_test-8\"\n      },\n      {\n        \"title\": \"Why and how to make a decision tree\",\n        \"url\": \"https://lucid.co/blog/how-to-make-a-decision-tree\"\n      },\n      {\n        \"title\": \"4 Types of Dashboards: Operational, Analytical, Strategic & Tactical\",\n        \"url\": \"https://www.klipfolio.com/blog/starter-guide-to-dashboards\"\n      }\n    }\n  }\n}"}