{"extracted_information": "Discord'un landing sayfası, kendini \"Eğlence ve Oyunların Olduğu Grup Sohbeti\" olarak konumlandırarak, geleneksel mesajlaşma platformlarından ayrışır. Temel mesajlaşma işlevlerinin ötesinde, kullanıcılara arkadaşlarla takılma, oyun oynama ve küresel topluluklar oluşturma imkanı sunan bir sosyal alan vurgusu yapılır. Görsel hikaye anlatımı, eğlenceli, arkadaş canlısı ve kapsayıcı bir atmosfer yaratmaya odaklanmıştır. Kullanıcı etkileşimini artırmak için kişiselleştirme, kesintisiz iletişim ve ortak etkinlikler öne çıkarılmıştır.", "specifications": {}, "pricing": {}, "features": [{"name": "Grup Sohbeti", "description": "Oyun oynamak, arkadaşlarla takılmak veya dünya çapında topluluklar kurmak için. Kendi alanını konuşmak, oynamak ve takılmak için özelleştirme.", "details": ["Özel emoji", "Çıkartmalar", "Soundboard efektleri", "Avatar belirleme", "Özel durum ayarlama", "Kendi profilini yazma"]}, {"name": "Yüksek Kaliteli Yayın", "description": "Yüksek kaliteli ve düşük gecikmeli yayın, arkadaşlarla kanepede takılıyormuş gibi hissettirir; oyun oynarken, şov izlerken, fotoğraf bakarken veya ders çalışırken.", "details": ["Yüksek kalite", "Düşük gecikme"]}, {"name": "Kolay Katılım", "description": "Kimseyi aramak veya davet etmek zorunda kalmadan sesli veya metin sohbetlerine kolayca girip çıkma imkanı, parti sohbetinin oyun oturumu öncesinde, sırasında ve sonrasında devam etmesini sağlar."}, {"name": "Çevrimiçi Durum Görünürlüğü", "description": "Kimlerin müsait olduğunu, oyun oynadığını veya sadece takıldığını görme. Desteklenen oyunlar için arkadaşların hangi modlarda veya karakterlerde oynadığını görme ve doğrudan katılma."}, {"name": "Ortak Etkinlikler", "description": "Video izleme, dahili oyunlar oynama, müzik dinleme veya birlikte kaydırıp meme gönderme. Metin, arama, görüntülü sohbet ve oyunları tek bir grup sohbetinde sorunsuz bir şekilde yapma."}, {"name": "Çapraz Platform Desteği", "description": "PC, telefon veya konsol üzerinden erişilebilir. Cihazlar arasında kolayca geçiş yapma ve birden fazla grup sohbetini yönetme araçları."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}