{"extracted_information": "WhatsApp, Instagram, Facebook Messenger ve Snapchat uygulamalarının medya yükleme arayüzleri ve düzenleme özelliklerine ilişkin karşılaştırmalı bilgiler aşağıda özetlenmiştir.", "specifications": {}, "pricing": {}, "features": [{"app": "WhatsApp", "media_upload_interface": "Kullanıcılar fotoğraflarına filtreler uygulayabilir, emojiler ekleyebilir, metin yazabilir veya çizim yapabilir. Animasyonlar ve 'çılgın' stil seçenekleri diğer uygulamalara kıyasla sınırlıdır.", "common_features": ["Bireysel veya grup sohbetlerinde fotoğraf ve video paylaşımı", "Emoji desteği"]}, {"app": "Instagram", "media_upload_interface": "İçerik eklemek için ekranın altındaki '+' düğmesine basılır, fotoğraf çekilir, filtre uygulanır ve paylaşılır. Geniş bir filtre yelpazesi sunar. Fotoğrafları kırpma, renk/sıcaklık dengesini değiştirme ve Layout uygulamasıyla kolaj oluşturma seçenekleri mevcuttur. Boomerang özelliği ile kısa videoları ileri ve geri oynatma imkanı sunar.", "common_features": ["Sosyal medya platformu olarak öne çıkar", "Hikayeler (Stories) oluşturma ve paylaşma", "Instagram Direct üzerinden özel video/fotoğraf/mesaj gönderimi"]}, {"app": "Facebook Messenger", "media_upload_interface": "Snapchat'ten ilham alarak birçok eğlenceli katman, özel efekt ve görüntü üzerine not alma seçeneği sunar. Disko topları, Game of Thrones tarzı ejderha ateşi gibi efektler içerir. Sanatsal filtreler ve çeşitli başlıklar da kullanılabilir.", "common_features": ["Bireysel veya grup sohbetlerinde fotoğraf ve video paylaşımı", "Emoji desteği", "Hikayeler (Stories) oluşturma ve paylaşma"]}, {"app": "Snapchat", "media_upload_interface": "Uygulama açıldığında kamera otomatik olarak devreye girer. Yüz animasyonları (şapka, hayvan özellikleri, sosisli sandviçe dönüşme gibi), sanatsal stil tabanlı filtreler sunar. Görüntülere mesaj ekleme, çizim yapma veya coğrafi etiketli başlıklar ekleme imkanı vardır. Oluşturulan içerik, kaydedilmediği sürece 24 saat içinde otomatik olarak silinir.", "common_features": ["Kamera merkezli arayüz", "Hikayeler (Stories) oluşturma ve paylaşma (özellikle Grup Hikayeleri)", "Geçici içerik vurgusu"]}, {"feature_type": "Ortak Medya Özelliği", "description": "Tüm uygulamalar Hikayeler (Stories) oluşturma yeteneğine sahiptir. Bu özellik, kısa görüntü ve video koleksiyonlarının bir araya getirilip arkadaşlarla paylaşılmasına olanak tanır. Snapchat bu fikri başlatan uygulama olsa da, şimdi tüm platformlarda standart bir özelliktir."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}