{"extracted_information": "WhatsApp'ın resmi UI güncellemeleri, tasarım yaklaşımı, renk paleti ve ikon güncellemeleri hakkında Meta tarafından detaylı açıklamalar bulunmaktadır. Bu güncellemeler, WhatsApp'ı taze, sade ve erişilebilir tutma felsefesiyle gerçekleştirilmiştir.", "specifications": {}, "pricing": {}, "features": [{"name": "Tasarım Yaklaşımı", "description": "WhatsApp tasarım felsefesi, uygulamanın basit, güvenilir ve gizli tutulması prensiplerine dayanmaktadır. Tasarım, sezgisel ve açık akışlar oluşturmayı hedefler, evrensel olarak çalışır ve insanların gizliliklerini korurken bağlantı kurmalarına yardımcı olur. Kullanıcıların cihazlarını kullanma şekillerine dikkat edilerek, WhatsApp'ın tanıdık ve kolay gezilebilir hissetmesi sağlanmıştır. Uygulamanın işlevselliği arttıkça tasarımın da gelişmesi gerektiği düşünülerek, ürünün temel işlevselliğini bozmadan daha modern ve taze hissettirmesi amaçlanmıştır.", "principles": [{"name": "Fresh (Taze)", "detail": "WhatsApp taze, eğlenceli ve cihaza özgü, tanıdık bir görünüme sahip olmalı."}, {"name": "Approachable (Erişilebilir)", "detail": "Herkes WhatsApp'ı rahatça kullanabilmeli. Erişilebilir, işletim sistemi içinde evinde hissettiren ve şüphesiz WhatsApp — davetkar ve biraz ilginç — olmalı."}, {"name": "Simple (Basit)", "detail": "Yeni tasarım basitliği artırmalı, ölçeklenebilir ve geleceğe dönük olmalı."}]}, {"name": "Renk Paleti Güncellemesi", "description": "Uygulama içinde birleşik bir deneyim için yeni, tutarlı bir yeşil paleti tanıtılmıştır. 35'ten fazla farklı renk iterasyonu değerlendirilmiş ve WhatsApp'ın ikonik yeşiliyle uyumlu, uygulama genelinde uyumlu renk eşleşmelerine olanak tanıyan bir palet tercih edilmiştir. Nötr renklerin kullanımı artırılarak yeşilin nerede ve nasıl kullanılacağı konusunda daha seçici olunmuştur.", "details": ["Yeni, tutarlı yeşil palet", "35'ten fazla renk iterasyonu değerlendirildi", "Nötr renklerin kullanımında artış"], "dark_mode": {"description": "Koyu modun daha karanlık olması yönündeki talepler üzerine, düşük ışıklı ortamlarda göz yorgunluğunu azaltmak için daha yüksek kontrast ve daha derin tonlara odaklanılmıştır. Gelişmiş görsel çekicilik ve okunabilirlik için bir ton daha koyu yapılmıştır.", "improvement": "Bir ton daha koyu, daha iyi görsel çekicilik ve okunabilirlik"}}, {"name": "İkon ve İllüstrasyon Güncellemeleri", "description": "İkonlar, istenen eyleme veya bilgiye hızlı görsel ipuçları eklemeye yardımcı olduğu için sezgisel ve tanınabilir olmaları önemlidir. WhatsApp, ikonlarını yuvarlak, hatlı bir stile güncellerken, yeni ikonografiye uyması için illüstrasyonlarını da yenilemiş ve daha eğlenceli bir estetik için animasyon eklemiştir.", "icon_style": "Yuvarlak, hatlı stil", "illustration_update": "Yenilenmiş illüstrasyonlar ve animasyonlar", "doodle_background": {"description": "Sohbetlerdeki orijinal varsayılan arka plan (doodle) yenilenmiştir. Çoğu kişinin doodle'ı kullandığı ancak bunun daha benzersiz ve günlük konuşmalarla daha ilişkili hale getirilmesi için bir fırsat olduğu belirtilmiştir. Ekip, doodle'daki her sanat eserini gözden geçirmiş ve basit bir stilde, farklı insanları ve nesneleri daha iyi temsil eden yeni seçenekler araştırmıştır."}}, {"name": "Navigasyonu Kolaylaştırma", "details": [{"platform": "Android", "feature": "Alt Gezinme Çubuğu", "description": "İnsanların ihtiyaç duydukları şeyi daha hızlı bulmalarına yardımcı olmak için daha modern, yerel bir alt gezinme çubuğu eklenmiştir. Sekmelerin parmaklara daha yakın yerleştirilmesi daha doğal bir gezinme sunar ve mevcut Android cihaz deneyimiyle uyumludur."}, {"platform": "iOS", "feature": "Yeni Ek Ekleme Düzeni (Attachment Layout)", "description": "iOS'ta fotoğraf ve video göndermek artık yeni bir ek ekleme düzeniyle daha kolay. Tam ekran menüsü yerine, medya, anketler, belgeler ve daha fazlasını gönderirken özellikleri daha net görmenizi sağlayan genişletilebilir bir tepsi eklenmiştir."}]}, {"name": "Daha İyi Sohbet Yönetimi", "feature": "Sohbet Filtreleri", "description": "Mesajlar için daha iyi organizasyon araçları talebi üzerine sohbet filtreleri tanıtılmıştır. Android'de gezinme çubuğunun alta taşınması, filtrelerin sohbet listesinin en üstüne yerleştirilmesine olanak sağlamıştır, böylece kullanıcılar tüm gelen kutularında kaydırma yapmadan doğru konuşmaları hızlıca bulabilirler. Artık okunmamış ve grup filtreleri arasında tek dokunuşla seçim yapılarak kaçırılan mesajlar veya favori grup sohbetleri kolayca takip edilebilir."}], "statistics": {}, "temporal_info": {"publication_date": "9 Mayıs 2024"}, "geographical_data": {}, "references": []}