{"extracted_information": "Material UI, ücretsiz React şablonları koleksiyonu sunmaktadır. Bu koleksiyonda, özellikli bir kontrol paneli (dashboard) ve CRUD kontrol paneli dahil olmak üzere çeşitli uygulama türleri için şablonlar bulunmaktadır. Tüm şablonlar özelleştirilebilir temalara, açık ve koyu mod desteğine sahiptir ve kaynak kodundan kolayca indirilebilir.", "specifications": {}, "pricing": {"status": "Ücretsiz", "details": "Belirtilen tüm şablonlar ücretsizdir."}, "features": [{"name": "Genel Şablon Özellikleri", "description": "Material UI ile uygulama oluşturmaya başlamak için ücretsiz React şablonları koleksiyonu. Tüm şablonlar özel bir tema ve varsayılan Material Design 2 temasına sahiptir, her ikisi için de açık ve koyu modlar mevcuttur. Bölümler yorumlarla veya ayrı dosyalarla tanımlanmıştır, bu da sayfaların parçalarını (örneğin bir kahraman birimi veya alt bilgi) çıkarmayı ve yeniden kullanmayı kolaylaştırır. Mevcut örnek projelerle birleştirilerek eksiksiz bir başlangıç uygulaması oluşturulabilir. Kaynak kodundan, CodeSandbox veya StackBlitz aracılığıyla indirilebilir."}, {"name": "Dashboard (Kontrol Paneli)", "description": "MUI X Data Grid ve Charts içeren karmaşık bir veri görselleştirme kontrol paneli."}, {"name": "Marketing page (Pazarlama Sayfası)", "description": "Ürün özellikleri, referanslar, fiyatlandırma ve SSS bölümleri içeren duyarlı bir pazarlama sayfası düzeni."}, {"name": "Checkout (Ödeme Akışı)", "description": "Tamamen özelleştirilebilir adımlara sahip gelişmiş bir ödeme akışı."}, {"name": "Sign-in (Giriş Sayfası)", "description": "Temiz ve verimli bir giriş sayfası."}, {"name": "Sign-in side (Yan Giriş Sayfası)", "description": "Formun yanı sıra içerik eklemek için duyarlı, iki sütunlu bir giriş sayfası."}, {"name": "Sign-up (Kayıt Sayfası)", "description": "Bir giriş şablonuyla eşleştirmek için mükemmel, temiz ve verimli bir kayıt sayfası."}, {"name": "Blog", "description": "Markdown-to-jsx aracılığıyla Markdown desteği olan şık, modern bir blog ana sayfası düzeni."}, {"name": "CRUD dashboard (CRUD Kontrol Paneli)", "description": "CRUD sayfaları ve yüksek düzeyde özelleştirilebilir kenar çubuğu ile mobil uyumlu düzene sahip kontrol paneli."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}