{"extracted_information": "Bu belge, birden fazla dosya yükleme bileşeninin tasarım yönergelerini ve kalıplarını açıklamaktadır. Kullanıcıların birden fazla dosyayı belirli bir konuma seçip yüklemesine olanak tanır. Genellikle formlarda bulunur ancak bağımsız bir öğe olarak da kullanılabilir.", "specifications": {}, "pricing": {}, "features": [{"name": "Bileşen Elemanları", "details": ["**Etiket (Label):** Kullanıcılara bileşenle nasıl etkileşim kuracaklarını bildiren metin. Sürükle ve bırak veya düğmeye tıklayarak dosya yükleyebileceğinizi açıklayan metin içermelidir.", "**Açıklama (Description):** Kullanıcının dosya türü ve boyutu hakkında bilinçli bir seçim yapmasına yardımcı olan yardımcı metin.", "**Düğme (Button):** Tercih edilirse dosya yüklemek için bir düğme.", "**Akordeon Metni (Accordion text):** Yüklenen toplam dosya sayısını ve tamamlanıp tamamlanmadıklarını veya devam edip etmediklerini açıklar.", "**Yükleme İlerlemesi (Progress upload):** Yüklenen dosyanın adı, dosya boyutu, ilerleme çubuğu ve yüzde değeri."]}, {"name": "Kullanım Durumları", "details": ["1 veya daha fazla dosya yükleme.", "Dosyaları sürükleyip bırakarak yükleme.", "Yükleme sürecini gösterme (özellikle büyük dosyalar için önemlidir; küçük dosyalar için gereksiz olabilir)."]}, {"name": "En İyi Uygulamalar", "details": ["**Boyutlandırma:** Bırakma bölgesini bağlamınıza uyacak şekilde değiştirin. Formlara yerleştirirken, bırakma bölgesinin genişliğini form alanlarıyla hizalayın.", "**Hizalama:** Bırakma bölgesini sayfadaki içerikle sola hizalayın. Birden fazla dosya dikey olarak alt alta sıralanacaktır.", "Bileşen, ihtiyaçlarınıza göre belirli dosya türlerini ve boyutlarını kısıtlamak için ayarlanabilir."]}, {"name": "Davranış", "details": ["**Temel İş Akışı:** Yüklenecek dosyaları sürükleyip bırakın veya seçin. Yükleme durumu ilerleme çubuğuyla gösterilir. Dosya adı ve 'x' (kapatma/silme işareti) dosya yüklendikten sonra görünür.", "**Yükle Düğmesiyle Dosya Yükleme:** Kullanıcılar bırakma bölgesindeki düğmeye tıklayarak dosya yükleyebilir. Bu, bir dosya seçici iletişim kutusu açar. Seçilen dosyalar, bırakma bölgesinin altında görünür ve yükleme başarılı olmadan önce yükleme durumu gösterebilir.", "**Dosyaları Sürükle ve Bırak:** Kullanıcılar dosyaları doğrudan belirlenen bırakma bölgesine sürükleyip bırakabilir. Sürükleme sırasında bırakma bölgesinin rengi aktif alanı belirtmek için değişir ve imleç değişimi (tarayıcı tarafından oluşturulur) yüklenmek üzere olan dosyaların önizlemesini gösterir.", "**Yükleme Durumları:** Yüklenmekte olan bir dosyanın 3 farklı durumu vardır: bekliyor, devam ediyor ve yüklendi.", "**Doğrulama:** Belirli bir dosya başarıyla yüklenemediğinde, ilgili dosya bir hata durumu gösterir. Hata mesajları, kullanıcının hatayı çözmesine yardımcı olmak için net rehberlik sağlamalıdır."]}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [{"type": "Not", "description": "Bu bileşen, metin önizlemesi gerektirmeyen tekli ve çoklu dosya yükleme senaryoları içindir. Metin önizlemesini destekleyen tekli dosya yüklemesi için 'file upload component' (dosya yükleme bileşeni) bölümüne bakınız."}]}