{"extracted_information": "Slack'in yeni tasarımı, kullanıcıların daha odaklanmış ve üretken olmasını sağlamak amacıyla geliştirilmiştir. Ana prensipler, kolay gezinme, dikkat dağıtıcı unsurları azaltma ve temel araçlara hızlı erişimdir. Özellikle 'Home' adı verilen tek bir görünümde tüm kanalları, direkt mesajları ve uygulamaları toplar. Birden fazla çalışma alanı olan Enterprise Grid kullanıcıları için, tüm çalışma alanlarındaki kanalları tek bir 'Home' görünümünde görüntüleme yeteneği eklenerek geçiş yapma ihtiyacı ortadan kaldırılmıştır. Tasarımın kalbinde, kullanıcının dikkatini odaklamasına yardımcı olan 'Activity', 'Direct Messages', 'Later' ve 'More' gibi özel görünümler bulunmaktadır. Bildirimler bu görünümlerin derinliklerine yerleştirilerek kullanıcıların ne zaman odaklanacaklarına karar vermelerine olanak tanır. Ayrıca, mesajlar, kanallar, tuvaller ve toplantılar gibi öğeleri oluşturmak için yeni bir 'oluştur' düğmesi eklenerek rutin eylemler daha hızlı hale getirilmiştir. Arama deneyimi de güncellenmiş, böylece kullanıcılar bir sonuç içine tıklayarak tam bağlamı görebilir ve ileri geri gitme ihtiyacı ortadan kalkar. Slack'in misyonu, insanların çalışma hayatlarını daha basit, daha keyifli ve daha verimli hale getirmektir ve bu deneyim bu amaçla inşa edilmiştir.", "specifications": {"release_date": "9 Ağustos 2023", "rollout_status": "Yeni ekiplere yayılmaya başladı, mevcut kullanıcılara önümüzdeki aylarda ulaşacak", "design_improvements_count": "Son bir yılda platformda 100'den fazla iyileştirme yapıldı"}, "pricing": {"more_functionality_differing": "More' işlevselliği ücretsiz ve ücretli planlar için biraz farklılık göstermektedir."}, "features": ["Yeniden Tasarlanmış Slack (Odaklanma için Yapılandırılmış)", "Organizasyon ve sezgisel düzen iyileştirmeleri", "Kolay kanal ve konuşma navigasyonu", "Önemli olanlara odaklanma yeteneği", "Temel araçları kolayca bulma ve kullanma", "Tek Görünüm: 'Home' (kanallar, direkt mesajlar, uygulamalar)", "Enterprise Grid için çoklu çalışma alanı kanallarını 'Home' içinde tek bir görünümde görüntüleme", "Odaklanmış çalışmaya yönelik özel görünümler: 'Activity', 'Direct Messages', 'Later', 'More'", "Bildirimler özel görünümlerin derinliklerine yerleştirildi", "Tek tıklamayla en kullanışlı araçlara erişim", "Yeni 'oluştur' düğmesi (yeni mesajlar, kanallar, tuvaller, toplantılar başlatmak için)", "Geliştirilmiş arama deneyimi (tam bağlamı görmek için sonuca tıklama)"], "statistics": {}, "temporal_info": {"redesign_announcement_date": "9 Ağustos 2023", "rollout_timeline": "Önümüzdeki aylar"}, "geographical_data": {}, "references": [{"title": "A redesigned Slack, built for focus", "author": "Rebecca Walker", "date": "August 9th, 2023"}, {"title": "Slack AI'ı nasıl güvenli ve özel hale getirdik?", "url": "https://slack.com/blog/news/how-we-built-slack-ai-to-be-secure-and-private"}, {"title": "Satış Otomasyonu: Tükenmişlik Olmadan Üretkenlik Nasıl Artırılır?", "url": "https://slack.com/blog/productivity/sales-automation-how-to-boost-productivity-without-burnout"}, {"title": "Her Şeyi Bulun: Slack'te Kurumsal Aramayı Tanıtıyoruz", "url": "https://slack.com/blog/news/slack-enterprise-search-uncover-knowledge-work-smarter"}, {"title": "Yapay Zeka Akıllı Aracılar: Yeni Dijital Ekip Arkadaşlarınız", "url": "https://slack.com/blog/transformation/ai-intelligent-agents-your-new-digital-teammates"}]}