{"extracted_information": "Slack'in iniş sayfası, yapay zeka entegrasyonu ve işbirliği odaklı çözümlerini vurgulayarak kullanıcıları hedefliyor. Sayfa, güçlü görseller, istatistiksel veriler ve kurumsal referanslarla ürünün değerini ve faydalarını ön plana çıkarıyor.", "specifications": {}, "pricing": {"approach": "Bu sayfada açık bir fiyatlandırma bilgisi, planlar veya fiyatlandırma yaklaşımları bulunmamaktadır. Kullanıcıları ürünün özellikleri ve faydaları hakkında bilgilendirmeye odaklanılmıştır."}, "features": [{"name": "Yapay Zeka Destekli İş Yönetimi ve Üretkenlik Araçları", "description": "Yapay zeka ajanlarıyla birlikte paylaşım, tartışma ve işlerin tamamlanması. İnsanları, projeleri, uygulamaları ve yapay zeka ajanlarını bir araya getirme.", "details": "Sınırsız yolla iletişim kurma, harici kuruluşları konuşmaya dahil etme. Şirket geçmişinde arama yapma, konuşmaları anında takip etme, kaçırılan mesajların günlük özetlerini alma."}, {"name": "Gelişmiş Proje Yönetimi", "description": "Görevleri önceliklendirme, fikirleri paylaşma ve uyumlu kalma. Slack, projenizin her parçasını başlangıçtan bitişe kadar bir araya getirir."}, {"name": "Uygulama Entegrasyonları", "description": "Halihazırda kullanılan araçları entegre etme. Günlük görevleri iş akışı içinde otomatikleştirme ve değerli zaman tasarrufu sağlama."}, {"name": "Yapay Zeka Ajanları", "description": "Satış tekliflerini güncelleme, ekip hatırlatıcıları ayarlama, BT sorunlarını çözme ve çok daha fazlasını her zaman aktif, aksiyon alan yapay zeka ajanlarıyla yapabilme."}], "statistics": {"slack_connect_fortune_100_usage": "Fortune 100 şirketlerinin %80'i iş ortakları ve müşterilerle çalışmak için Slack Connect kullanıyor.", "team_productivity_increase": "Slack kullanan ekipler için üretkenlikte %47 artış.", "automation_time_saved": "Slack kullanıcıları için otomasyon sayesinde zaman tasarrufunda %35 artış.", "slack_ai_weekly_time_saving": "Slack AI ile kullanıcıların haftalık ortalama 97 dakika tasarruf edebilmesi.", "user_connectivity_satisfaction": "Kullanıcıların %87'si Slack'in daha bağlantıda kalmalarına yardımcı olduğunu söylüyor.", "average_apps_used_by_teams": "Ekiplerin Slack'te kullandığı ortalama uygulama sayısı: 'bilgi mevcut değil' (veri kaynakları kısmında belirtilmiş ancak sayı verilmemiş)", "user_collaboration_efficiency_satisfaction": "Kullanıcıların %86'sı Slack'in daha verimli işbirliği yapmalarına yardımcı olduğunu söylüyor.", "slack_connect_weekly_users": "Haftalık 4 milyon Slack Connect kullanıcısı harici ekiplerle doğrudan çalışıyor.", "apps_actively_used_weekly": "Haftalık 1.7 milyon uygulama aktif olarak kullanılıyor.", "g2_market_reports_leadership": "Slack, 290'dan fazla G2 pazar raporunda lider."}, "temporal_info": {"g2_awards_year": "2025 Yazı"}, "geographical_data": {}, "references": ["1: FY25 Slack internal data, product usage analysis.", "2: FY23 Slack Customer Tracking Survey. Internal survey of weekly active Slack users in the US, UK, CA, and AU. Total n = 1,456.", "3: FY24 Customer Success Metrics. Base: Total n = 247-1,696, Slack internal data.", "4: Based on an internal analysis during the pilot of Slack AI features (channel recaps, thread summaries, and AI search answers).", "5: FY25 Slack Customer Tracking Survey. Internal survey of weekly active Slack users in the US, UK, CA, and AU. Total n = 2,410.", "6: G2 Summer 2025 market reports for enterprise search, knowledge base, employee Q&A, audio conferencing, business instant messaging, unified workspaces, project management, work management, workflow management, project collaboration and more."]}